{
  "updated": "2026-01-06",
  "total": 4,
  "owasp_id": "ML09",
  "owasp_name": "Output Integrity Attack",
  "description": "Attacks that manipulate or corrupt model outputs. This includes output\n        manipulation, prediction tampering, confidence score manipulation, and\n        techniques to alter model responses after inference. Also covers attacks\n        on model explanations and interpretability outputs.",
  "note": "Classified by embeddings (threshold=0.3)",
  "papers": [
    {
      "paper_id": "39b748fe7bfe1b7c063339de1ec90f0e0351ffda",
      "title": "Defending against model extraction attacks with physical unclonable function",
      "abstract": null,
      "year": 2023,
      "venue": "Information Sciences",
      "authors": [
        "Dawei Li",
        "Di Liu",
        "Ying Guo",
        "Yangkun Ren",
        "Jieyu Su",
        "Jianwei Liu"
      ],
      "citation_count": 11,
      "url": "https://www.semanticscholar.org/paper/39b748fe7bfe1b7c063339de1ec90f0e0351ffda",
      "pdf_url": "",
      "publication_date": "2023-05-01",
      "keywords_matched": [
        "model extraction",
        "model extraction attack",
        "(via citation)"
      ],
      "first_seen": "2025-12-05"
    },
    {
      "paper_id": "c774bb2b6cb1108773a0e86aff0fc00003c7397a",
      "title": "Finite‐state model extraction and visualization from Java program execution",
      "abstract": "Finite‐state models are extensively used for discrete systems and they have also been adopted for the analysis and verification of concurrent systems. Programs that have a repetitive cycle, such as event‐driven servers and controllers, lend themselves to finite‐state modeling. In this article, we use the term model extraction to refer to the construction of a finite‐state model from an execution trace of a Java program and a set of key attributes, that is, a subset of the fields of the objects in the program execution. By choosing different sets of attributes, different finite‐state models (or views) of the execution can be obtained. Such models aid program comprehension and they can also be used in debugging a program. We present algorithms for model extraction and also for model abstraction in order to reduce the size of the extracted models so that they are amenable to visualization. For long executions, we show how to minimize the overhead of execution trace collection through a bytecode instrumentation technique; and, for large models, which are not amenable to visualization, we show how key properties of the extracted model can be checked against declarative specifications. We have implemented our techniques in the context of JIVE, an Eclipse plugin that supports runtime visualization and analysis of Java program executions. We illustrate our techniques through a collection of case studies of varying size and complexity, from classic problems of concurrency control to a medium‐size protocol for authorization (OAuth2.0 protocol) to a large‐scale software that underlies web applications (Apache Tomcat server).",
      "year": 2020,
      "venue": "Software, Practice & Experience",
      "authors": [
        "Jevitha K. P.",
        "Swaminathan Jayaraman",
        "B. Jayaraman",
        "Sethumadhavan M"
      ],
      "citation_count": 16,
      "url": "https://www.semanticscholar.org/paper/c774bb2b6cb1108773a0e86aff0fc00003c7397a",
      "pdf_url": "",
      "publication_date": "2020-10-11",
      "keywords_matched": [
        "model extraction"
      ],
      "first_seen": "2025-11-28"
    },
    {
      "paper_id": "9329e150170534e99d169a345aa68aeb004279ca",
      "title": "The Attack of the Clones against Proof-of-Authority",
      "abstract": "In this paper, we explore vulnerabilities and countermeasures of the recently proposed blockchain consensus based on proof-of-authority. The proof-of-work blockchains, like Bitcoin and Ethereum, have been shown both theoretically and empirically vulnerable to double spending attacks. This is why Byzantine fault tolerant consensus algorithms have gained popularity in the blockchain context for their ability to tolerate a limited number t of attackers among n participants. We formalize the recently proposed proof-of-authority consensus algorithms that are Byzantine fault tolerant by describing the Aura and Clique protocols present in the two mainstream implementations of Ethereum. We then introduce the Cloning Attack and show how to apply it to double spend in each of these protocols with a single malicious node. Our results show that the Cloning Attack against Aura is always successful while the same attack against Clique is about twice as fast and succeeds in most cases.",
      "year": 2019,
      "venue": "Network and Distributed System Security Symposium",
      "authors": [
        "Parinya Ekparinya",
        "Vincent Gramoli",
        "Guillaume Jourjon"
      ],
      "citation_count": 89,
      "url": "https://www.semanticscholar.org/paper/9329e150170534e99d169a345aa68aeb004279ca",
      "pdf_url": "https://doi.org/10.14722/ndss.2020.24082",
      "publication_date": "2019-02-26",
      "keywords_matched": [
        "cloning attack"
      ],
      "first_seen": "2025-12-05"
    },
    {
      "paper_id": "3ba1d07d015d843dbfa6b6b4a8e433b3ee2caa18",
      "title": "Research on Key Protocol Technology of Safe Access and Imitation Attack for Power Industrial Control Terminal Equipment",
      "abstract": "Industrial control system is widely used in social production activities and its security is directly related to national security and social stability. In this paper, the security threats and protection status of power industry control system are analyzed. A framework of information security evaluation system for power industry control system is proposed, which consists of three parts: experimental verification environment, product detection capability and security service capability, and the construction scheme of the system is discussed. A hardware-in-the-loop simulation and verification platform is constructed to realize the simulation and verification of power industry control system tools. The vulnerability of power industry control protocol can be found in depth. The problem of ambiguous attack mechanism and lack of verification means of power industry control system is discussed, which can provide support for the research of attack and protection of power industry control system.",
      "year": 2019,
      "venue": "IOP Conference Series: Materials Science and Engineering",
      "authors": [
        "Xiaoqiang Wang",
        "Rui",
        "Zhao Xuehai Yu",
        "Jinye Zhang"
      ],
      "citation_count": 0,
      "url": "https://www.semanticscholar.org/paper/3ba1d07d015d843dbfa6b6b4a8e433b3ee2caa18",
      "pdf_url": "https://doi.org/10.1088/1757-899x/677/4/042068",
      "publication_date": "2019-12-10",
      "keywords_matched": [
        "imitation attack"
      ],
      "first_seen": "2025-12-05"
    }
  ]
}